ISUSimSL/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;


vertices
(
	(-6 0 6) //0
	(6 0 6)
	(6 0 -6)
	(-6 0 -6)
	(-6 4.028 6)
	(6 4.028 6) //5
	(6 4.028 -6)
	(-6 4.028 -6)

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (300 300 100) simpleGrading (1 1 1)

);

edges
(
);

boundary
(
	atmosphere
	{
		type inlet;
		faces
		(
			(0 4 7 3)
			(3 7 6 2)
			(2 6 5 1)
			(1 5 4 0)
			(7 4 5 6)
		);
	}
    ground
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    /*
    walls
    {
        type wall;
        faces
        (
			(16 8 10 17)
        );
    }
    */
);

mergePatchPairs
(
);

// ************************************************************************* //
