ISUSimSL/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver		GAMG;
	tolerance       1e-06;
        relTol          0.0;
	smoother	GaussSeidel;
	nPreSweeps	0;
	nPostSweeps	2;
	nCellsInCoarsestLevel 50;
    }

    U
    {
	solver		PBiCGStab;
	preconditioner	DILU;
	tolerance	1e-06;
	relTol		0.0;
    }

    "(k|omega)"
    {
        solver          smoothSolver;
        smoother	symGaussSeidel;
        tolerance       1e-06;
        relTol          0.1;
    }

}

SIMPLE
{
	nNonOrthogonalCorrectors 1;
    
	residualControl
	{
		p				1e-4;
		U				1e-5;
		"(k|omega)"		1e-4;
	}
}

relaxationFactors
{
    fields
    {
        p               0.2;
    }
    equations
    {
	U		0.85;
        "(k|omega)"     0.1;
    }
}

cache
{
    grad(U);
}



// ************************************************************************* //
